## Plan Result (prod_mgmt - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace
  * module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub-sender




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace will be created
  + resource "azurerm_eventhub_namespace" "eventhub-namespace" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "uksouth"
      + minimum_tls_version                       = (known after apply)
      + name                                      = "prod-dlrm-eventhub-ns"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "ingest-mgmt-rg-prod"
      + sku                                       = "Premium"
      + tags                                      = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + zone_redundant                            = false
    }

  # module.data_mgmt_zone.azurerm_eventhub_namespace_authorization_rule.eventhub-sender will be created
  + resource "azurerm_eventhub_namespace_authorization_rule" "eventhub-sender" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "dlrm-eventhub-namespace-sender"
      + namespace_name                    = "prod-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-prod"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace has been deleted
  - resource "azurerm_eventhub_namespace" "eventhub-namespace" {
        id                                        = "/subscriptions/e9674938-57cb-43ff-a440-1917658e468c/resourceGroups/ingest-mgmt-rg-prod/providers/Microsoft.EventHub/namespaces/prod-dlrm-eventhub-ns"
      - name                                      = "prod-dlrm-eventhub-ns" -> null
        tags                                      = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Target":"prod_mgmt - TerraformPlanApply","Vars":{}} -->